# Pandas 학습

### 1. Pandas란?

- Wes McKinney에 의해 개발
- Numpy 기반, 데이터 핸들링에 특화 (매우 유연&편리)
- 파이썬 내부 데이터 + CSV 등의 파일을 쉽게 DataFrame으로 변경 가능
- 데이터의 가공/분석이 매우 용이함

#### 1) 핵심 객체 DataFrame

- DataFrame : 여러 행/열로 이뤄진 2차원 데이터를 담는 구조체 (칼럼이 여러 개)
- Series : 칼럼이 하나뿐인 구조체
- Index : 개별 데이터를 고유하게 식별하는 Key 값

### 2. Pandas 시작 - 파일을 DataFrame으로 로딩, 기본 API

In [1]:
import pandas as pd

- https://www.kaggle.com/c/titanic/data?select=train.csv
- 타이타닉 탑승자 데이터 파일 다운로드 (파일명 : titanic_train.csv)

#### 1) read_csv() 함수

- 로딩된 파일을 DataFrame 객체로 반환하는 함수
- 콤마로 분리된 데이터값을 칼럼에 맞게 할당
- 맨 왼쪽 값은 판다스의 Index 객체 값.

In [4]:
#csv 파일을 로딩
titanic_df = pd.read_csv(r'C:\Users\jes45\titanic_train.csv')
#맨 앞의 3개만 반환
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [3]:
#csv 파일을 로딩
titanic_df = pd.read_csv('titanic_train.csv')
print('titanic 변수 type : ', type(titanic_df))
titanic_df

titanic 변수 type :  <class 'pandas.core.frame.DataFrame'>

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [5]:
print('DataFrame 크기 : ', titanic_df.shape)

DataFrame 크기 :  (891, 12)

- info() 메서드 : 총 데이터 건수, 데이터 타입, Null 건수 등을 알려줌

In [6]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

- describe() 메서드 : 숫자형 칼럼에 대한 개략적인 데이터 분포도 확인 가능

In [7]:
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [ ]:
value_counts = titanic

### 3. Dataframe과 List, Dictionary, Numpy ndarray 상호 변환

#### 1) Numpy ndarray, List, Dictionary를 DataFrame으로 변환하기

#### 2) DataFrame을 Numpy ndarray, List, Dictionary로 변환하기

### 4. DataFrame의 칼럼 데이터 세트 생성과 수정

### 5. DataFrame 데이터 삭제

### 6. Index 객체

### 7. 데이터 셀렉션 및 필터링

#### 1) DataFrame의 [] 연산자

#### 2) DataFrame의 ix[] 연산자

#### 3) 명칭 기반 인덱싱과 위치 기반 인덱싱의 구분

#### 4) DataFrame iloc[] 연산자

#### 5) DataFrame loc[] 연산자

#### 6) Boolean 인덱싱

### 8. 정렬, Aggregation 함수, GroupBy 적용

#### 1) DataFrame, Series의 정렬 - sort_values()

#### 2) Aggregation 함수 적용

#### 3) groupby() 적용

### 9. 결손 데이터 처리하기

#### 1) isna()로 결손 데이터 여부 확인

#### 2) fillna()로 결손 데이터 대체하기

### 10. apply lambda 식으로 데이터 제공